public class Main {
    public static void main(String[] args) {
        //Циклы
        //Задача 1.
        //С помощью цикла for выведите в консоль все числа от 1 до 10.
        for (int c = 1; c <= 10; c = c + 1 ) {
            System.out.println("Итерация цикла " + c );
        }
        System.out.println("====================================================================================");
        //Задача 2
        //С помощью цикла for выведите в консоль все числа от 10 до 1.
        for (int f = 10; f >= 1; f = f - 1 ) {
            System.out.println("Итерация цикла " + f );
        }
        System.out.println("====================================================================================");
        //Задача 3
        //Выведите в консоль все четные числа от 0 до 17.
        for (int a = 0; a <= 17; a = a + 2 ) {
            System.out.println("Чётное число " + a);
        }
        System.out.println("====================================================================================");
        //Задача 4
        //Выведите в консоль все числа от 10 до −10 от бо́льшего числа к меньшему.
        for (int b = 10; b >= -10; b = b - 1 ) {
            System.out.println("Вывод " + b );
        }
        System.out.println("====================================================================================");
        //Урок с Ильёй Сазоновым.Високосный год.
        for (int yearV = 2020; yearV <= 2070; yearV = yearV + 4 ) {
            System.out.println(yearV + " " + "год является високосным.");
        }
        System.out.println("====================================================================================");
        //Задача 5
        //Напишите программу, которая выводит в консоль все високосные года, начиная с 1904 года до 2096.
        // В консоль результат должен выводиться в формате: «… год является високосным».
        for ( int yearVis =1904 ; yearVis <= 2096; yearVis = yearVis + 4 ) {
            System.out.println(yearVis + " " + "год является високосным.");
        }
        System.out.println("====================================================================================");
        //Задача 6
        //Напишите программу, которая выводит в консоль последовательность чисел:
        //7 14 21 28 35 42 49 56 63 70 77 84 91 98
        for ( int number = 7 ; number <= 98 ; number = number + 7 ) {
            System.out.print(number + " ");
        }
        System.out.println(" ");
        //Задача 7
        //Напишите программу, которая выводит в консоль последовательность чисел:
        //1 2 4 8 16 32 64 128 256 512
        for ( int n = 1 ; n <= 512 ; n = n * 2 ) {
            System.out.print(n +" ");}
        System.out.println(" ");
        //Урок с Ильёй Сазоновым.
        double salary = 65535;
        double total = 0;
        for ( int i = 1 ; i <= 12 ; i = i + 1) {
            total = total + total/100;
            total = total + salary;
            String result = String.format("%.2f",total);
            System.out.println("Зарплата программиста за месяц " + i + " " + "к выплате " +  result + " " +
                    "рублей.");}
        System.out.println("====================================================================================");
        //Задача 8
        //Посчитайте с помощью цикла for сумму годовых накоплений, если каждый месяц вы будете откладывать по
        // 29 000 рублей «в банку».
        //Выведите сумму накоплений за каждый месяц в консоль в формате: «Месяц …, сумма накоплений равна … рублей».
        int deposit = 29000;
        int depositTotal = 0;
        for (int x = 1 ; x <= 12 ; x = x + 1) {
            depositTotal = depositTotal + deposit;
            System.out.println("Месяц " + x + "," +"сумма накоплений равна " + depositTotal + " " + "рублей.");}
        System.out.println("===========================================================================================");
        //Задача 9
        //Перепишите решение задачи выше при условии, что деньги вы откладывать будете не «в банку»,
        // а в банк под проценты — 12% годовых. Выведите сумму накоплений за каждый месяц в консоль в формате:
        // «Месяц …, сумма накоплений равна … рублей».
        double depositNew = 29000;
        double depositNewTotal = 0;
        for (int z = 1 ; z <= 12 ; z = z + 1 ) {
            depositNewTotal = depositNewTotal + depositNewTotal/100;
            depositNewTotal = depositNewTotal + depositNew;
            String result = String.format("%.2f",depositNewTotal);
            System.out.println("Месяц " + z + "," +"сумма накоплений равна " + result + " " + "рублей.");
        }
        System.out.println("====================================================================================");
        //Задача 10
        //Напишите программу, которая выводит в консоль таблицу умножения на 2:
        //2*1=2
        //2*2=4
        //2*3=6
        //2*4=8
        //2*5=10
        //2*6=12
        //2*7=14
        //2*8=16
        //2*9=18
        //2*10=20
        int u = 0;
        for ( int y = 1 ; y <= 10 ; y = y + 1 ) {
            u = 2 * y ;
            System.out.println("2*" + y + "=" + u );}
        System.out.println("===================================================================================");

            System.out.println("Hello Russia!Hello China!Hello world!");
    }
}